DataProcessors/абс_ФормированиеПоступленийРеализаций/абс_ФормированиеПоступленийРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ФормированиеПоступленийРеализаций</name>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипФормированияДокументов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПродавец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперацияПоступление</name>
    <type>
      <types>CatalogRef.абс_ХозяйственныеОперацииПУБ77</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперацияРеализация</name>
    <type>
      <types>CatalogRef.абс_ХозяйственныеОперацииПУБ77</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРазбиватьПоНоменклатурнымГруппам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажи</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПокупки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделитьПоМаркировкеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательПродавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/ВидыОперацийРеализацияТоваров/ВидыОперацийРеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРеализацияТоваров</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПродажаКомиссия</name>
  </enumValues>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаБезПереходаПраваСобственности</name>
  </enumValues>
  <enumValues>
    <name>Оборудование</name>
  </enumValues>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Catalogs/НоменклатурныеГруппы/НоменклатурныеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатурныеГруппы</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
</mdclass:Catalog>

DataProcessors/абс_ФормированиеПоступленийРеализаций/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ТипФормированияДокументов = 1 Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен период!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипФормированияДокументов = 2 Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Период) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен период!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Дерево.ПолучитьЭлементы().Количество()>0 Тогда
		Если Вопрос("Перед заполненением таблица будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Дерево.ПолучитьЭлементы().Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДеревоНоменклатуры();
	
	РазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	Отказ=Ложь;
	Если Объект.Организация.Пустая() Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Не заполнена организация!";
		Сообщение.Сообщить();
		Отказ=Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ДатаФормирования) Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Не заполнена дата формирования документов!";
		Сообщение.Сообщить();
		Отказ=Истина;
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДокументыСервер();
	
	РазвернутьДерево();
	
КонецПроцедуры

&НаСервере
//формирует документы РеализацияТоваровУслуг и ПоступлениеТоваров(на основании реализации)
Процедура СформироватьДокументыСервер()
	ДеревоОбъект=РеквизитФормыВЗначение("Дерево");
	
	//Проверим что документу уже не были сфорованы в этой форме ранее
	ЕстьДокументы=Ложь;
	Для Каждого СтрокаСклад Из ДеревоОбъект.Строки Цикл 
		Для каждого СтрокаОрганизации Из СтрокаСклад.Строки Цикл
			Для каждого СтрокаГруппа из СтрокаОрганизации.Строки Цикл
				Если Не СтрокаГруппа.ДокументПоступления.Пустая() ИЛИ Не СтрокаГруппа.ДокументРеализации.Пустая() Тогда
					ЕстьДокументы=Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ЕстьДокументы Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Документы уже были сформированы!";
		Сообщение.Сообщить();
		//Возврат;
	КонецЕсли;
	
	ОсновнойКонтрагент=ПолучитьКонтрагентаПоОрганизации(Объект.Организация);
	Если Не ЗначениеЗаполнено(ОсновнойКонтрагент) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не найден контрагент по организации " + Объект.Организация + ". Необходимо заполнить регистр сведений ""Контрагенты организаций""");
	КонецЕсли;
	
	//сформируем документы
	Для Каждого СтрокаСклад Из ДеревоОбъект.Строки Цикл
		Если Не СтрокаСклад.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Склад = СтрокаСклад.Номенклатура;
		
		Для каждого СтрокаОрганизация Из СтрокаСклад.Строки Цикл
			Если Не СтрокаОрганизация.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Контрагент=ПолучитьКонтрагентаПоОрганизации(СтрокаОрганизация.Номенклатура);
			
			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Не найден контрагент по организации " + СтрокаОрганизация.Номенклатура + ". Необходимо заполнить регистр сведений ""Контрагенты организаций""");
			КонецЕсли;
			
			Для каждого СтрокаГруппа из СтрокаОрганизация.Строки Цикл
				Если Не СтрокаГруппа.Пометка Тогда
					Продолжить;
				КонецЕсли;
				
				//НачатьТранзакцию();
				
				//+Лео Сафонов ЕА
				//формирование документа Реализация товаров и услуг
				Если  СтрокаГруппа.ДокументРеализации.Пустая() Тогда
					ДокументРеализацияОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Иначе 
					ДокументРеализацияОбъект = СтрокаГруппа.ДокументРеализации.ПолучитьОбъект();
					ДокументРеализацияОбъект.Товары.Очистить();
				КонецЕсли;
				//-Лео Сафонов ЕА

				
				//ДокументРеализацияОбъект=Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				ЗаполнитьДокументРеализации(ДокументРеализацияОбъект,Объект.Организация,Контрагент,Склад,СтрокаГруппа);				
				ДокументРеализацияОбъект.абс_ХозяйственнаяОперация = Объект.ХозОперацияРеализация;
				ДокументРеализацияОбъект.ОтражатьВУправленческомУчете = Истина;
				ДокументРеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаГруппа.ДокументРеализации=ДокументРеализацияОбъект.Ссылка;
				
				//+Лео Сафонов ЕА
				ДокументСчФактураВыданный = Документы.СчетФактураВыданный.ПустаяСсылка();
				ДокументСчФактураВыданный =  УчетНДС.НайтиПодчиненныйСчетФактуру(СтрокаГруппа.ДокументРеализации, "СчетФактураВыданный");
				Если  ДокументСчФактураВыданный = Документы.СчетФактураВыданный.ПустаяСсылка() Или  ДокументСчФактураВыданный = Неопределено Тогда
					ДокументСчФактураВыданный = Документы.СчетФактураВыданный.СоздатьДокумент();	
				Иначе
					ДокументСчФактураВыданный = ДокументСчФактураВыданный.ПолучитьОбъект() ;
				КонецЕсли;
				//-Лео Сафонов ЕА

				//ДокументСчФактураВыданный = Документы.СчетФактураВыданный.СоздатьДокумент(); 
				//+ Зароднюк Владимир
				//Заполнить не очищает табличную часть документ основание, выполним это сами 
				Если ДокументСчФактураВыданный.ДокументыОснования.Количество()>0 Тогда
					ДокументСчФактураВыданный.ДокументыОснования.Очистить();
				КонецЕсли;
				//- Зароднюк Владимир 
				
				ДокументСчФактураВыданный.Заполнить(СтрокаГруппа.ДокументРеализации);
				ДокументСчФактураВыданный.Записать(РежимЗаписиДокумента.Проведение);
				
				
				//формирование документа Поступление товаров и услуг
				//ДокументПоступлениеОбъект=Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
				//+Лео Сафонов ЕА
				Если  СтрокаГруппа.ДокументПоступления.Пустая() Тогда
					ДокументПоступлениеОбъект=Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
				Иначе 
					ДокументПоступлениеОбъект = СтрокаГруппа.ДокументПоступления.ПолучитьОбъект();
					ДокументПоступлениеОбъект.Товары.Очистить();
				КонецЕсли;
				//-Лео Сафонов ЕА
				ЗаполнитьДокументПоступления(ДокументПоступлениеОбъект,СтрокаОрганизация.Номенклатура,ОсновнойКонтрагент,Склад,СтрокаГруппа,ДокументРеализацияОбъект.Ссылка);
				ДокументПоступлениеОбъект.абс_ХозяйственнаяОперация = Объект.ХозОперацияПоступление;
				ДокументПоступлениеОбъект.ОтражатьВУправленческомУчете = Истина;
				ДокументПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
				СтрокаГруппа.ДокументПоступления=ДокументПоступлениеОбъект.Ссылка;
				
				
				//+Лео Сафонов ЕА
				ДокументСчФактураПолученный = Документы.СчетФактураПолученный.ПустаяСсылка();
				ДокументСчФактураПолученный =  УчетНДС.НайтиПодчиненныйСчетФактуру(СтрокаГруппа.ДокументПоступления, "СчетФактураПолученный");
				Если  ДокументСчФактураПолученный = Документы.СчетФактураПолученный.ПустаяСсылка() Или  ДокументСчФактураПолученный = Неопределено Тогда
					ДокументСчФактураПолученный = Документы.СчетФактураПолученный.СоздатьДокумент();	
				Иначе
					ДокументСчФактураПолученный = ДокументСчФактураПолученный.ПолучитьОбъект() ;
				КонецЕсли;
				//-Лео Сафонов ЕА

				//ДокументСчФактураПолученный = Документы.СчетФактураПолученный.СоздатьДокумент();
				Если НЕ ДокументСчФактураПолученный.ДокументОснование = ДокументПоступлениеОбъект.Ссылка Тогда
					ДокументСчФактураПолученный.Заполнить(СтрокаГруппа.ДокументПоступления);
				КонецЕсли;	
				ДокументСчФактураПолученный.НомерВходящегоДокумента = ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументСчФактураВыданный.Ссылка);
				ДокументСчФактураПолученный.ДатаВходящегоДокумента = ДокументСчФактураВыданный.Дата;
				ДокументСчФактураПолученный.Записать(РежимЗаписиДокумента.Проведение);
				//ЗафиксироватьТранзакцию();
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоОбъект,"Дерево");	
	
КонецПроцедуры

&НаСервере
//получает контрагента из РегистраСведений КонтрагентыОрганизаций
Функция ПолучитьКонтрагентаПоОрганизации(Организация)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтрагентыСвязанныеСОрганизациями.Контрагент
	|ИЗ
	|	РегистрСведений.КонтрагентыСвязанныеСОрганизациями КАК КонтрагентыСвязанныеСОрганизациями
	|ГДЕ
	|	КонтрагентыСвязанныеСОрганизациями.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация",Организация);
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Контрагент;
	КонецЕсли;
КонецФункции

&НаСервере
//заполняет реквизиты созданного документа РеализацияТоваровУслуг
Процедура ЗаполнитьДокументРеализации(ДокументОбъект,Организация,Контрагент,Склад,СтрокаДерева)
	ДоговорКонтрагента=Контрагент.ОсновнойДоговорКонтрагента;
	 Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ВалютаДокумента = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	Иначе
		ВалютаДокумента = ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		// Если цены выбранного типа расчетные, то флаги включения налогов надо брать из базовой цены.
		ВремТипЦен       = ?(Объект.ТипЦен.Рассчитывается, Объект.ТипЦен.БазовыйТипЦен, Объект.ТипЦен);
		СуммаВключаетНДС = ВремТипЦен.ЦенаВключаетНДС;
	Иначе
		// Заполним значениями по умолчанию (не заполнен ТипЦен).
		СуммаВключаетНДС= Истина;
	КонецЕсли;
	
	ДокументОбъект.Дата							= Объект.ДатаФормирования;
	ДокументОбъект.Организация					= Организация;
	ДокументОбъект.ВидОперации					= Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
	//ДокументОбъект.Склад						= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
	ДокументОбъект.Склад						= Склад;
	ДокументОбъект.Ответственный				= глЗначениеПеременной("глТекущийПользователь");
	ДокументОбъект.Контрагент					= Контрагент;  
	
	ДокументОбъект.Грузоотправитель				= Объект.ГрузоотправительПроизводитель;
	ДокументОбъект.Грузополучатель				= Объект.ГрузополучательПродавец;
	
	//+Лео Сафонов ЕА
	Если Объект.ДоговорПродажи = Справочники.ДоговорыКонтрагентов.ПустаяСсылка()Тогда
		ДокументОбъект.ДоговорКонтрагента		= ПолучитьДоговорКонтрагента(Контрагент,Организация,Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Иначе
		ДокументОбъект.ДоговорКонтрагента = Объект.ДоговорПродажи;
	КонецЕсли;
	
	Если ДокументОбъект.Лев_НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка()Тогда
		Если ТипЗнч(СтрокаДерева.Номенклатура) =  Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			ДокументОбъект.Лев_НоменклатурнаяГруппа = СтрокаДерева.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	//-Лео Сафонов ЕА

	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не найден договор контрагента """ + Контрагент + """ с организацией """ + Организация + """ с видом договора ""с покупателем""");
	КонецЕсли;
	ДокументОбъект.ВалютаДокумента				= ВалютаДокумента;
	СтруктураКурсаВзаиморасчетов 				= МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, ОбщегоНазначения.ПолучитьРабочуюДату());
	ДокументОбъект.КурсВзаиморасчетов     	    = СтруктураКурсаВзаиморасчетов.Курс;
	ДокументОбъект.КратностьВзаиморасчетов 	    = СтруктураКурсаВзаиморасчетов.Кратность;
	ДокументОбъект.ОтражатьВУправленческомУчете = Истина;
	ДокументОбъект.ВидПередачи					= Перечисления.ВидыПередачиТоваров.СоСклада;
	ДокументОбъект.ТипЦен						= Объект.ТипЦен;
	ДокументОбъект.УчитыватьНДС					= Истина;
	ДокументОбъект.СуммаВключаетНДС				= СуммаВключаетНДС;
	ДокументОбъект.абс_Статус					= Перечисления.абс_СтатусыОтгрузки.Отгружен;
	ДокументОбъект.абс_СФормированАвтоматически = Истина;
	ДокументОбъект.Комментарий					= "#Документ сформирован автоматически"+?(Объект.РазделитьПоМаркировкеЧЗ И Объект.ТипФормированияДокументов=1," #Товар маркирован ЧЗ#","#Без маркировки"); 	
	//заполнение табличной части
	Для каждого СтрокаНоменклатура из СтрокаДерева.Строки Цикл
		Если Не СтрокаНоменклатура.Пометка Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока=ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаНоменклатура);
		НоваяСтрока.Коэффициент =1;
		НоваяСтрока.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ДокументОбъект, "Реализация");
		ОбработкаТабличныхЧастей.ЗаполнитьСпособСписанияОстаткаТоваровТабЧасти(НоваяСтрока, ДокументОбъект);
		//ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(НоваяСтрока, ДокументОбъект, глЗначениеПеременной("ВалютаРегламентированногоУчета"));
		Цена = Ценообразование.ПолучитьЦенуНоменклатуры(НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры,
		Объект.ТипЦен, ДокументОбъект.Дата, НоваяСтрока.ЕдиницаИзмерения,
		ДокументОбъект.ВалютаДокумента, ДокументОбъект.КурсВзаиморасчетов, ДокументОбъект.КратностьВзаиморасчетов, ,
		ДокументОбъект.ДоговорКонтрагента,
		ДокументОбъект.УсловиеПродаж);
		
		// Если цену заполнили из регистра, то ее надо пересчитывать по флагам налогообложения.
		Если НЕ ЗначениеЗаполнено(Цена) Тогда
			НоваяСтрока.Цена = 0;
		Иначе
			НоваяСтрока.Цена = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена,
			Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
			ОБъект.ТипЦен.ЦенаВключаетНДС,
			ДокументОбъект.УчитыватьНДС,
			ДокументОбъект.СуммаВключаетНДС,
			УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
		КонецЕсли;
		
		// Если единица оказалась не заполненной, то заполняем ее основной единицей номеклатуры.
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуМестТабЧасти(НоваяСтрока, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументОбъект);
	КонецЦикла;    
	
	//Доработка поэкземплярного учата
	// для проверки кодов номенклатуры выбираем поштучно  
	Если Объект.РазделитьПоМаркировкеЧЗ И Объект.ТипФормированияДокументов=1 
		И Организация=Справочники.Организации.НайтиПоКоду("О00000003") И Контрагент=Справочники.Контрагенты.НайтиПоКоду("К00001098") Тогда
		Запрос	=	Новый Запрос;
		Запрос.Текст	=	"ВЫБРАТЬ
		            	 	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		            	 	|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
		            	 	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
		            	 	|ИЗ
		            	 	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		            	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		            	 	|			НоменклатураЧЗ.Объект КАК Номенклатура,
		            	 	|			НоменклатураЧЗ.Значение КАК Значение,
		            	 	|			ВЫБОР
		            	 	|				КОГДА НоменклатураЧЗ.Значение.ЧестныйЗнак = ИСТИНА
		            	 	|					ТОГДА ИСТИНА
		            	 	|				ИНАЧЕ ЛОЖЬ
		            	 	|			КОНЕЦ КАК ЗначениеЧестныйЗнак
		            	 	|		ИЗ
		            	 	|			(ВЫБРАТЬ
		            	 	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		            	 	|				ЗначенияСвойствОбъектов.Значение КАК Значение
		            	 	|			ИЗ
		            	 	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		            	 	|			ГДЕ
		            	 	|				ЗначенияСвойствОбъектов.Свойство = &Свойство) КАК НоменклатураЧЗ) КАК НоменклатураМаркировкиЧЗ
		            	 	|		ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураМаркировкиЧЗ.Номенклатура
		            	 	|ГДЕ
		            	 	|	РеализацияТоваровУслугТовары.Ссылка.Проведен
		            	 	|	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		            	 	|	И РеализацияТоваровУслугТовары.Ссылка.абс_Статус В(&СтатусыРеализаций)
		            	 	|	И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
		            	 	|	И НоменклатураМаркировкиЧЗ.ЗначениеЧестныйЗнак
		            	 	|
		            	 	|СГРУППИРОВАТЬ ПО
		            	 	|	РеализацияТоваровУслугТовары.Номенклатура,
		            	 	|	РеализацияТоваровУслугТовары.СерияНоменклатуры";
		Запрос.УстановитьПараметр("ДатаНачала"			, НачалоДня(Объект.ДатаНачала));
		Запрос.УстановитьПараметр("ДатаОкончания"		, КонецДня(Объект.ДатаОкончания));
		Запрос.УстановитьПараметр("Организация"			, Объект.ОрганизацияПродавец);
		Запрос.УстановитьПараметр("Свойство"			, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));

		СпСтатусовРеализации = Новый Массив;
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ВРаботе);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Закрыт);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
		
		Запрос.УстановитьПараметр("СтатусыРеализаций", СпСтатусовРеализации);
		
		ЗапросПодбораКодов	=	Новый Запрос;
		ЗапросПодбораКодов.Текст	=	"ВЫБРАТЬ
		                        	 	|	РеализацияТоваровУслугСписокКоробок.Номенклатура КАК Номенклатура,
		                        	 	|	РеализацияТоваровУслугСписокКоробок.СерияНоменклатуры,
		                        	 	|	РеализацияТоваровУслугСписокКоробок.ШтрихКодКоробки
		                        	 	|ИЗ
		                        	 	|	Документ.РеализацияТоваровУслуг.СписокКоробок КАК РеализацияТоваровУслугСписокКоробок
		                        	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                        	 	|			НоменклатураЧЗ.Объект КАК Номенклатура,
		                        	 	|			НоменклатураЧЗ.Значение КАК Значение,
		                        	 	|			ВЫБОР
		                        	 	|				КОГДА НоменклатураЧЗ.Значение.ЧестныйЗнак = ИСТИНА
		                        	 	|					ТОГДА ИСТИНА
		                        	 	|				ИНАЧЕ ЛОЖЬ
		                        	 	|			КОНЕЦ КАК ЗначениеЧестныйЗнак
		                        	 	|		ИЗ
		                        	 	|			(ВЫБРАТЬ
		                        	 	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		                        	 	|				ЗначенияСвойствОбъектов.Значение КАК Значение
		                        	 	|			ИЗ
		                        	 	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		                        	 	|			ГДЕ
		                        	 	|				ЗначенияСвойствОбъектов.Свойство = &Свойство) КАК НоменклатураЧЗ) КАК НоменклатураМаркировкиЧЗ
		                        	 	|		ПО РеализацияТоваровУслугСписокКоробок.Номенклатура = НоменклатураМаркировкиЧЗ.Номенклатура
		                        	 	|ГДЕ
		                        	 	|	РеализацияТоваровУслугСписокКоробок.Ссылка.Проведен
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.Ссылка.абс_Статус В(&СтатусыРеализаций)
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.Ссылка.Организация = &Организация
		                        	 	|	И НоменклатураМаркировкиЧЗ.ЗначениеЧестныйЗнак
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.СерияНоменклатуры = &СерияНоменклатуры	
		                        	 	|	И РеализацияТоваровУслугСписокКоробок.Номенклатура = &Номенклатура";
		ЗапросПодбораКодов.УстановитьПараметр("ДатаНачала"			, НачалоДня(Объект.ДатаНачала));
		ЗапросПодбораКодов.УстановитьПараметр("ДатаОкончания"		, КонецДня(Объект.ДатаОкончания));
		ЗапросПодбораКодов.УстановитьПараметр("Организация"			, Объект.ОрганизацияПродавец);
		ЗапросПодбораКодов.УстановитьПараметр("Свойство"			, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
		ЗапросПодбораКодов.УстановитьПараметр("СтатусыРеализаций"	, СпСтатусовРеализации); 

		ЗапросПодбораКодовQR	=	Новый Запрос;
		ЗапросПодбораКодовQR.Текст	=	"ВЫБРАТЬ
		                          	 	|	РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура КАК Номенклатура,
		                          	 	|	РеализацияТоваровУслугШтучныеQR_Коды.СерияНоменклатуры КАК СерияНоменклатуры,
		                          	 	|	РеализацияТоваровУслугШтучныеQR_Коды.QR_Код_Входящий КАК QR_Код
		                          	 	|ИЗ
		                          	 	|	Документ.РеализацияТоваровУслуг.ШтучныеQR_Коды КАК РеализацияТоваровУслугШтучныеQR_Коды
		                          	 	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                          	 	|			НоменклатураЧЗ.Объект КАК Номенклатура,
		                          	 	|			НоменклатураЧЗ.Значение КАК Значение,
		                          	 	|			ВЫБОР
		                          	 	|				КОГДА НоменклатураЧЗ.Значение.ЧестныйЗнак = ИСТИНА
		                          	 	|					ТОГДА ИСТИНА
		                          	 	|				ИНАЧЕ ЛОЖЬ
		                          	 	|			КОНЕЦ КАК ЗначениеЧестныйЗнак
		                          	 	|		ИЗ
		                          	 	|			(ВЫБРАТЬ
		                          	 	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		                          	 	|				ЗначенияСвойствОбъектов.Значение КАК Значение
		                          	 	|			ИЗ
		                          	 	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		                          	 	|			ГДЕ
		                          	 	|				ЗначенияСвойствОбъектов.Свойство = &Свойство) КАК НоменклатураЧЗ) КАК НоменклатураМаркировкиЧЗ
		                          	 	|		ПО РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура = НоменклатураМаркировкиЧЗ.Номенклатура
		                          	 	|ГДЕ
		                          	 	|	РеализацияТоваровУслугШтучныеQR_Коды.Ссылка.Проведен
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.Ссылка.абс_Статус В(&СтатусыРеализаций)
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.Ссылка.Организация = &Организация
		                          	 	|	И НоменклатураМаркировкиЧЗ.ЗначениеЧестныйЗнак
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.СерияНоменклатуры = &СерияНоменклатуры
		                          	 	|	И РеализацияТоваровУслугШтучныеQR_Коды.Номенклатура = &Номенклатура";	
		ЗапросПодбораКодовQR.УстановитьПараметр("ДатаНачала"			, НачалоДня(Объект.ДатаНачала));
		ЗапросПодбораКодовQR.УстановитьПараметр("ДатаОкончания"		, КонецДня(Объект.ДатаОкончания));
		ЗапросПодбораКодовQR.УстановитьПараметр("Организация"			, Объект.ОрганизацияПродавец);
		ЗапросПодбораКодовQR.УстановитьПараметр("Свойство"			, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
		ЗапросПодбораКодовQR.УстановитьПараметр("СтатусыРеализаций"	, СпСтатусовРеализации); 

		Выборка	= Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Сообщить(Выборка.Номенклатура);	 
            //таблица коробок
			ЗапросПодбораКодов.УстановитьПараметр("Номенклатура"		, Выборка.Номенклатура); 
			ЗапросПодбораКодов.УстановитьПараметр("СерияНоменклатуры"	, Выборка.СерияНоменклатуры); 
			
			ВыборкаКодов	= ЗапросПодбораКодов.Выполнить().Выбрать();
			
			Пока ВыборкаКодов.Следующий() Цикл
				НовыйКодКоробки	=	ДокументОбъект.СписокКоробок.Добавить();	
			    НовыйКодКоробки.Номенклатура		=	ВыборкаКодов.Номенклатура;	
			    НовыйКодКоробки.СерияНоменклатуры	=	ВыборкаКодов.СерияНоменклатуры;	
			    НовыйКодКоробки.ШтрихКодКоробки		=	ВыборкаКодов.ШтрихКодКоробки;	
			КонецЦикла;
            //таблица QR кодов
			ЗапросПодбораКодовQR.УстановитьПараметр("Номенклатура"		, Выборка.Номенклатура); 
			ЗапросПодбораКодовQR.УстановитьПараметр("СерияНоменклатуры"	, Выборка.СерияНоменклатуры); 
			
			ВыборкаКодовQR	= ЗапросПодбораКодовQR.Выполнить().Выбрать();
			
			Пока ВыборкаКодовQR.Следующий() Цикл
				НовыйКодQR	=	ДокументОбъект.ШтучныеQR_Коды.Добавить();	
			    НовыйКодQR.Номенклатура			=	ВыборкаКодовQR.Номенклатура;	
			    НовыйКодQR.СерияНоменклатуры	=	ВыборкаКодовQR.СерияНоменклатуры;	
			    НовыйКодQR.QR_Код_Входящий		=	ВыборкаКодовQR.QR_Код;	
			КонецЦикла;
	    КонецЦикла;
	КонецЕсли;	
	ДокументОбъект.СуммаДокумента				= ДокументОбъект.Товары.Итог("Сумма");
КонецПроцедуры

&НаСервере
//заполняет реквизиты созданного документа ПоступлениеТовароУслуг (на основании Реализации)
Процедура ЗаполнитьДокументПоступления(ДокументОбъект,Организация,Контрагент,Склад,СтрокаДерева,ДокументПоступлениеСсылка)
	ДокументОбъект.Дата = Объект.ДатаФормирования;
	ДокументОбъект.Заполнить(ДокументПоступлениеСсылка);
	ДокументОбъект.Организация = Организация;
	ДокументОбъект.Контрагент = Контрагент;
	
	ДокументОбъект.Грузоотправитель				= Объект.ГрузоотправительПроизводитель;
	ДокументОбъект.Грузополучатель				= Объект.ГрузополучательПродавец;
	
	//+Лео Сафонов ЕА
	Если Объект.ДоговорПокупки = Справочники.ДоговорыКонтрагентов.ПустаяСсылка()Тогда
		ДокументОбъект.ДоговорКонтрагента = ПолучитьДоговорКонтрагента(Контрагент,Организация,Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Иначе
		ДокументОбъект.ДоговорКонтрагента = Объект.ДоговорПокупки;
	КонецЕсли;
	
	Если ДокументОбъект.Лев_НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка()Тогда
		Если ТипЗнч(СтрокаДерева.Номенклатура) =  Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			ДокументОбъект.Лев_НоменклатурнаяГруппа = СтрокаДерева.Номенклатура;
		КонецЕсли;
	КонецЕсли;

	//-Лео Сафонов ЕА
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ДоговорКонтрагента) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не найден договор контрагента """ + Контрагент + """ с организацией """ + Организация + """ с видом договора ""с поставщиком""");
	КонецЕсли;
	ДокументОбъект.СкладОрдер = Склад;
	ДокументОбъект.абс_ДокументОснование = Неопределено;
	ДокументОбъект.Комментарий = "#Документ сформирован автоматически"+?(Объект.РазделитьПоМаркировкеЧЗ И Объект.ТипФормированияДокументов=1," #Товар маркирован ЧЗ#","#Без маркировки");
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокументОбъект);
	ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокументОбъект, ДокументПоступлениеСсылка.ВалютаДокумента, глЗначениеПеременной("ВалютаРегламентированногоУчета"), СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары", ДокументПоступлениеСсылка.ДоговорКонтрагента);

    //{Катанович
	Если НалоговыйУчетУСН.ПрименениеУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
		ДокументОбъект.НДСВключенВСтоимость = Истина;
	КонецЕсли;
	//Катанович}
 
КонецПроцедуры

&НаСервере
//получает договор из справочника по контрагенту, организации и виду договора
Функция ПолучитьДоговорКонтрагента(Контрагент,Организация,ВидДоговора)
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Ссылка = ДоговорыКонтрагентов.Владелец.ОсновнойДоговорКонтрагента
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ";
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Договор;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаКлиенте
//разворачивает элемент формы дерево
Процедура РазвернутьДерево()
	Если Дерево.ПолучитьЭлементы().Количество()>0 Тогда
		Элементы.Дерево.Развернуть(Дерево.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
//процедура заполнения дерева по остаткам Регистра ТоварыОрганизаций по типу цен
Процедура ЗаполнитьДеревоНоменклатуры()
	
	ДеревоОбъект = РеквизитФормыВЗначение("Дерево");
	
	Запрос = Новый Запрос;
	
	Если Объект.ТипФормированияДокументов = 1 Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Организация,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		|	ВложенныйЗапрос.СерияНоменклатуры,
		|	ВложенныйЗапрос.Качество,
		|	ВложенныйЗапрос.Склад,
		|	ВложенныйЗапрос.Количество,
		|	ВложенныйЗапрос.НоменклатурнаяГруппа,
		|	НоменклатураЧЗ.ЗначениеЧестныйЗнак
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		ВложенныйЗапрос.СерияНоменклатуры КАК СерияНоменклатуры,
		|		ВложенныйЗапрос.Качество КАК Качество,
		|		ВложенныйЗапрос.Склад КАК Склад,
		|		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
		|		ВложенныйЗапрос.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|	ИЗ
		|		(ВЫБРАТЬ
		|			РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
		|			РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|			РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|			РеализацияТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|			РеализацияТоваровУслугТовары.Качество КАК Качество,
		|			РеализацияТоваровУслугТовары.Ссылка.Склад КАК Склад,
		|			РеализацияТоваровУслугТовары.Количество КАК Количество,
		|			РеализацияТоваровУслугТовары.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ГДЕ
		|			РеализацияТоваровУслугТовары.Ссылка.Проведен
		|			И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			И РеализацияТоваровУслугТовары.Ссылка.абс_Статус В(&СтатусыРеализаций)
		|			И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ВложенныйЗапрос.Организация,
		|			ВложенныйЗапрос.Номенклатура,
		|			ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		|			ВложенныйЗапрос.СерияНоменклатуры,
		|			ВложенныйЗапрос.Качество,
		|			ВложенныйЗапрос.Склад,
		|			ВложенныйЗапрос.Количество,
		|			ВложенныйЗапрос.НоменклатураНоменклатурнаяГруппа
		|		ИЗ
		|			(ВЫБРАТЬ
		|				КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
		|				КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|				КорректировкаРеализацииТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|				КорректировкаРеализацииТовары.Качество КАК Качество,
		|				КорректировкаРеализацииТовары.Ссылка.Организация КАК Организация,
		|				КорректировкаРеализацииТовары.Ссылка.Склад КАК Склад,
		|				КорректировкаРеализацииТовары.Номенклатура.НоменклатурнаяГруппа КАК НоменклатураНоменклатурнаяГруппа,
		|				КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоКорректировки КАК Количество
		|			ИЗ
		|				Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|			ГДЕ
		|				КорректировкаРеализацииТовары.Ссылка.Проведен = ИСТИНА
		|				И КорректировкаРеализацииТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|				И КорректировкаРеализацииТовары.Ссылка.Организация = &Организация
		|				И КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоИзменения <> 0) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация,
		|		ВложенныйЗапрос.Номенклатура,
		|		ВложенныйЗапрос.СерияНоменклатуры,
		|		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		|		ВложенныйЗапрос.Качество,
		|		ВложенныйЗапрос.Склад,
		|		ВложенныйЗапрос.НоменклатурнаяГруппа) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НоменклатураЧЗ.Объект КАК Номенклатура,
		|			НоменклатураЧЗ.Значение КАК Значение,
		|			ВЫБОР
		|				КОГДА НоменклатураЧЗ.Значение.ЧестныйЗнак = ИСТИНА
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ КАК ЗначениеЧестныйЗнак
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = &Свойство) КАК НоменклатураЧЗ) КАК НоменклатураЧЗ
		|		ПО ВложенныйЗапрос.Номенклатура = НоменклатураЧЗ.Номенклатура
		|ГДЕ
		|	ВложенныйЗапрос.Количество > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВложенныйЗапрос1.ДокументПоступления) КАК ДокументПоступления,
		|	ВложенныйЗапрос1.Лев_НоменклатурнаяГруппа,
		|	МАКСИМУМ(ВложенныйЗапрос1.ДокументРеализации) КАК ДокументРеализации,
		|	ВложенныйЗапрос1.Склад
		|ПОМЕСТИТЬ ВТ_ДокументыПродажимеждуОрганизациями
		|ИЗ
		|	(ВЫБРАТЬ
		|		"""" КАК ДокументПоступления,
		|		РеализацияТоваровУслуг.Лев_НоменклатурнаяГруппа КАК Лев_НоменклатурнаяГруппа,
		|		РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
		|		РеализацияТоваровУслуг.Склад КАК Склад
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И РеализацияТоваровУслуг.Проведен = ИСТИНА
		|		И РеализацияТоваровУслуг.Организация = &ОрганизацияПроизводитель
		|		И РеализацияТоваровУслуг.ДоговорКонтрагента = &ДоговорПродажи
		|		И РеализацияТоваровУслуг.Комментарий ПОДОБНО &ТекстКомментарий
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПоступлениеТоваровУслуг.Ссылка,
		|		ПоступлениеТоваровУслуг.Лев_НоменклатурнаяГруппа,
		|		"""",
		|		ПоступлениеТоваровУслуг.СкладОрдер
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|	ГДЕ
		|		ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
		|		И ПоступлениеТоваровУслуг.Организация = &Организация
		|		И ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорПокупки
		|		И ПоступлениеТоваровУслуг.Комментарий ПОДОБНО &ТекстКомментарий) КАК ВложенныйЗапрос1
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос1.Лев_НоменклатурнаяГруппа,
		|	ВложенныйЗапрос1.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Организация КАК Организация,
		|	ТаблицаНоменклатуры.Номенклатура,
		|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры,
		|	ТаблицаНоменклатуры.СерияНоменклатуры,
		|	ТаблицаНоменклатуры.Качество,
		|	ТаблицаНоменклатуры.Склад КАК Склад,
		|	СУММА(ТаблицаНоменклатуры.Количество) КАК Количество,
		|	ВЫБОР
		|		КОГДА &НеРазбиватьПоНоменклатурнымГруппам = ИСТИНА
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаНоменклатуры.НоменклатурнаяГруппа
		|	КОНЕЦ КАК НоменклатурнаяГруппа,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Цена,
		|	СУММА(ТаблицаНоменклатуры.Количество * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1)) КАК Сумма,
		|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументПоступления КАК ДокументПоступления,
		|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументРеализации КАК ДокументРеализации
		|ИЗ
		|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&Период,
		|				(Номенклатура, ХарактеристикаНоменклатуры) В
		|						(ВЫБРАТЬ
		|							ТаблицаНоменклатуры.Номенклатура,
		|							ТаблицаНоменклатуры.ХарактеристикаНоменклатуры
		|						ИЗ
		|							ТаблицаНоменклатуры КАК ТаблицаНоменклатуры)
		|					И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|			ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ТаблицаНоменклатуры.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыПродажимеждуОрганизациями КАК ВТ_ДокументыПродажимеждуОрганизациями
		|		ПО ТаблицаНоменклатуры.НоменклатурнаяГруппа = ВТ_ДокументыПродажимеждуОрганизациями.Лев_НоменклатурнаяГруппа
		|			И ТаблицаНоменклатуры.Склад = ВТ_ДокументыПродажимеждуОрганизациями.Склад
		|ГДЕ
		|	ТаблицаНоменклатуры.Качество > 0
		|	//РазделитьПоМаркировкиЧЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатуры.Организация,
		|	ТаблицаНоменклатуры.Номенклатура,
		|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры,
		|	ТаблицаНоменклатуры.СерияНоменклатуры,
		|	ТаблицаНоменклатуры.Качество,
		|	ТаблицаНоменклатуры.Склад,
		|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументПоступления,
		|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументРеализации,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1),
		|	ВЫБОР
		|		КОГДА &НеРазбиватьПоНоменклатурнымГруппам = ИСТИНА
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаНоменклатуры.НоменклатурнаяГруппа
		|	КОНЕЦ
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Сумма),
		|	МАКСИМУМ(ДокументПоступления),
		|	МАКСИМУМ(ДокументРеализации)
		|ПО
		|	Склад,
		|	Организация,
		|	НоменклатурнаяГруппа";  
		
		
		//Если будет утеряно РазделитьПоМаркировкиЧЗ то его надо вставить сюда
		
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыПродажимеждуОрганизациями КАК ВТ_ДокументыПродажимеждуОрганизациями
		//|		ПО ТаблицаНоменклатуры.НоменклатурнаяГруппа = ВТ_ДокументыПродажимеждуОрганизациями.Лев_НоменклатурнаяГруппа
		//|			И ТаблицаНоменклатуры.Склад = ВТ_ДокументыПродажимеждуОрганизациями.Склад
		//|ГДЕ
		//|	ТаблицаНоменклатуры.Качество > 0
		//|	//РазделитьПоМаркировкиЧЗ
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТаблицаНоменклатуры.Организация,
		//|	ТаблицаНоменклатуры.Номенклатура,
		
		Если Объект.ДатаНачала>=Дата("20240528000000") Тогда                 //далее выставить дату начала процесса тестирования
			Если Объект.РазделитьПоМаркировкеЧЗ Тогда 
				Запрос.Текст	=	СтрЗаменить(Запрос.Текст,"//РазделитьПоМаркировкиЧЗ","И ТаблицаНоменклатуры.ЗначениеЧестныйЗнак = ИСТИНА");
			Иначе
				Запрос.Текст	=	СтрЗаменить(Запрос.Текст,"//РазделитьПоМаркировкиЧЗ","И НЕ ТаблицаНоменклатуры.ЗначениеЧестныйЗнак = ИСТИНА");
			КонецЕсли;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Период"			, Новый Граница(КонецДня(Объект.ДатаОкончания),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ДатаНачала"		, НачалоДня(Объект.ДатаНачала));
		Запрос.УстановитьПараметр("ДатаОкончания"	, КонецДня(Объект.ДатаОкончания));
		Запрос.УстановитьПараметр("ТипЦен"			, Объект.ТипЦен);
		Запрос.УстановитьПараметр("Организация"		, Объект.ОрганизацияПродавец);
		Запрос.УстановитьПараметр("НеРазбиватьПоНоменклатурнымГруппам"		, Объект.НеРазбиватьПоНоменклатурнымГруппам);
		Запрос.УстановитьПараметр("ОрганизацияПроизводитель" 	, Объект.Организация);
        Запрос.УстановитьПараметр("ДоговорПродажи" 	, Объект.ДоговорПродажи);
        Запрос.УстановитьПараметр("ДоговорПокупки" 	, Объект.ДоговорПокупки);
        Запрос.УстановитьПараметр("Свойство" 		, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000066"));
        Запрос.УстановитьПараметр("ТекстКомментарий", "#Документ сформирован автоматически"+?(Объект.РазделитьПоМаркировкеЧЗ И Объект.ТипФормированияДокументов=1," #Товар маркирован ЧЗ#","#Без маркировки"));

		
		СпСтатусовРеализации = Новый Массив;
		
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Отгружен);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ЗакрытаСборка);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ВПути);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.ВРаботе);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Подобран);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Закрыт);
		СпСтатусовРеализации.Добавить(Перечисления.абс_СтатусыОтгрузки.Доставлен);
		
		Запрос.УстановитьПараметр("СтатусыРеализаций", СпСтатусовРеализации);
		
	ИначеЕсли Объект.ТипФормированияДокументов = 2 Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыОрганизацийОстатки.Организация КАК Организация,
		|	ТоварыОрганизацийОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыОрганизацийОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТоварыОрганизацийОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ТоварыОрганизацийОстатки.Качество КАК Качество,
		|	ТоварыОрганизацийОстатки.Склад КАК Склад,
		|	ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) * -1 КАК Количество,
		|	ТоварыОрганизацийОстатки.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
		|ПОМЕСТИТЬ ТаблицаНоменклатуры
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(
		|			&Период,
		|			Комиссионер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				И Организация = &Организация
		|				И Склад = &Склад) КАК ТоварыОрганизацийОстатки
		|ГДЕ
		|	ТоварыОрганизацийОстатки.КоличествоОстаток < 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры,
		|	СерияНоменклатуры,
		|	Качество,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВложенныйЗапрос1.ДокументПоступления) КАК ДокументПоступления,
		|	ВложенныйЗапрос1.Лев_НоменклатурнаяГруппа,
		|	МАКСИМУМ(ВложенныйЗапрос1.ДокументРеализации) КАК ДокументРеализации
		|ПОМЕСТИТЬ ВТ_ДокументыПродажимеждуОрганизациями
		|ИЗ
		|	(ВЫБРАТЬ
		|		"""" КАК ДокументПоступления,
		|		РеализацияТоваровУслуг.Лев_НоменклатурнаяГруппа КАК Лев_НоменклатурнаяГруппа,
		|		РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И РеализацияТоваровУслуг.Проведен = ИСТИНА
		|		И РеализацияТоваровУслуг.Организация = &ОрганизацияПроизводитель
		|		И РеализацияТоваровУслуг.ДоговорКонтрагента = &ДоговорПродажи
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПоступлениеТоваровУслуг.Ссылка,
		|		ПоступлениеТоваровУслуг.Лев_НоменклатурнаяГруппа,
		|		""""
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|	ГДЕ
		|		ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
		|		И ПоступлениеТоваровУслуг.Организация = &ОрганизацияПродавец
		|		И ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорПокупки) КАК ВложенныйЗапрос1
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос1.Лев_НоменклатурнаяГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Организация КАК Организация,
		|	ТаблицаНоменклатуры.Номенклатура,
		|	ТаблицаНоменклатуры.ХарактеристикаНоменклатуры,
		|	ТаблицаНоменклатуры.СерияНоменклатуры,
		|	ТаблицаНоменклатуры.Качество,
		|	ТаблицаНоменклатуры.Склад КАК Склад,
		|	ТаблицаНоменклатуры.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА &НеРазбиватьПоНоменклатурнымГруппам = ИСТИНА
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
		|		ИНАЧЕ ТаблицаНоменклатуры.НоменклатурнаяГруппа
		|	КОНЕЦ КАК НоменклатурнаяГруппа,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Цена,
		|	ТаблицаНоменклатуры.Количество * ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) / ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Сумма,
		|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументПоступления КАК ДокументПоступления,
		|	ВТ_ДокументыПродажимеждуОрганизациями.ДокументРеализации КАК ДокументРеализации
		|ИЗ
		|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&Период,
		|				(Номенклатура, ХарактеристикаНоменклатуры) В
		|						(ВЫБРАТЬ
		|							ТаблицаНоменклатуры.Номенклатура,
		|							ТаблицаНоменклатуры.ХарактеристикаНоменклатуры
		|						ИЗ
		|							ТаблицаНоменклатуры КАК ТаблицаНоменклатуры)
		|					И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
		|			ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
		|		ПО ТаблицаНоменклатуры.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ТаблицаНоменклатуры.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыПродажимеждуОрганизациями КАК ВТ_ДокументыПродажимеждуОрганизациями
		|		ПО ТаблицаНоменклатуры.НоменклатурнаяГруппа = ВТ_ДокументыПродажимеждуОрганизациями.Лев_НоменклатурнаяГруппа
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Сумма),
		|	МАКСИМУМ(ДокументПоступления),
		|	МАКСИМУМ(ДокументРеализации)
		|ПО
		|	Склад,
		|	Организация,
		|	НоменклатурнаяГруппа";
		

		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Объект.Период),ВидГраницы.Включая));
        Запрос.УстановитьПараметр("ТипЦен", Объект.ТипЦен);
        Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.ДатаНачала));      //роман
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаНачала));    //роман
        Запрос.УстановитьПараметр("НеРазбиватьПоНоменклатурнымГруппам", Объект.НеРазбиватьПоНоменклатурнымГруппам);
        Запрос.УстановитьПараметр("Организация", Объект.ОрганизацияПродавец);
        Запрос.УстановитьПараметр("ОрганизацияПроизводитель", Объект.Организация);
        Запрос.УстановитьПараметр("ОрганизацияПродавец", Объект.ОрганизацияПродавец );//роман
        Запрос.УстановитьПараметр("ДоговорПродажи", Объект.ДоговорПродажи);
        Запрос.УстановитьПараметр("ДоговорПокупки", Объект.ДоговорПокупки);
		Запрос.УстановитьПараметр("Склад", Объект.Склад);

		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Сообщение=Новый СообщениеПользователю;
		Сообщение.Текст="Отсутствуют отрицательные остатки по номенклатуре. Формирование документов не требуется. Также статус документа не должен быть равен ""К Отгрузке""";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ВыборкаСклад=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
	Пока ВыборкаСклад.Следующий() Цикл
		СтрокаСклад = ДеревоОбъект.Строки.Добавить();
		СтрокаСклад.Пометка 		= Истина;
		СтрокаСклад.Номенклатура 	= ВыборкаСклад.Склад;
		
		ВыборкаОрганизация = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Организация");
		Пока ВыборкаОрганизация.Следующий() Цикл
			СтрокаОрганизация = СтрокаСклад.Строки.Добавить();
			СтрокаОрганизация.Пометка 		= Истина;
			СтрокаОрганизация.Номенклатура	= ВыборкаОрганизация.Организация;
			
			ВыборкаГруппа = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"НоменклатурнаяГруппа");
			Пока ВыборкаГруппа.Следующий() Цикл
				СтрокаГруппа=СтрокаОрганизация.Строки.Добавить();
				СтрокаГруппа.Пометка 			 = Истина;
				СтрокаГруппа.Номенклатура		 = ВыборкаГруппа.НоменклатурнаяГруппа;
				СтрокаГруппа.ДокументПоступления = ВыборкаГруппа.ДокументПоступления;
				СтрокаГруппа.ДокументРеализации  = ВыборкаГруппа.ДокументРеализации;
				
				ВыборкаНоменклатура=ВыборкаГруппа.Выбрать();
				Пока ВыборкаНоменклатура.Следующий() Цикл
					СтрокаНоменклатура			= СтрокаГруппа.Строки.Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрокаНоменклатура,ВыборкаНоменклатура);
					СтрокаНоменклатура.ДокументПоступления = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
					СтрокаНоменклатура.ДокументРеализации  = Документы.РеализацияТоваровУслуг.ПустаяСсылка();

					СтрокаНоменклатура.Пометка	= Истина;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоОбъект,"Дерево");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНоменклатураОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументПоступленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументПоступленияОчистка(Элемент, СтандартнаяОбработка)
	СтандартняОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументРеализацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументРеализацииОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		Объект.ТипЦен = Константы.абс_ТипЦенПродажиЛеовитЛеотон.Получить();
	КонецЕсли;
	
	Объект.ТипФормированияДокументов 			= 1;  
	Объект.НеРазбиватьПоНоменклатурнымГруппам	= Истина;
	Объект.Организация							= Справочники.Организации.НайтиПоКоду("О00000003");
	Объект.ОрганизацияПродавец					= Справочники.Организации.НайтиПоКоду("О00000001");
	Объект.ГрузоотправительПроизводитель		= Справочники.Контрагенты.НайтиПоКоду("К00000011");
	Объект.ГрузополучательПродавец				= Справочники.Контрагенты.НайтиПоКоду("К00001098");
	Объект.ДоговорПокупки						= Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000000248");
	Объект.ДоговорПродажи						= Справочники.ДоговорыКонтрагентов.НайтиПоКоду("000000249");
	Объект.ХозОперацияПоступление				= Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000012");
	Объект.ХозОперацияРеализация				= Справочники.абс_ХозяйственныеОперацииПУБ77.НайтиПоКоду("000000049");
	
	УстановитьВидимостьПериодаОтбораДокументов();
	УстановитьВидимостьОтбораПоСкладам();
	
КонецПроцедуры


&НаКлиенте
Процедура ТипФормированияДокументовПриИзменении(Элемент)
	
	УстановитьВидимостьПериодаОтбораДокументов();
	УстановитьВидимостьОтбораПоСкладам();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПериодаОтбораДокументов()
	
	Если Объект.ТипФормированияДокументов = 1 Тогда
		
		Элементы.ГруппаПериод.Видимость 	= Истина;
		Элементы.Период.Видимость 			= Ложь;
		
	ИначеЕсли Объект.ТипФормированияДокументов = 2 Тогда
		
		Элементы.ГруппаПериод.Видимость 	= Ложь;
		Элементы.Период.Видимость 			= Истина;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьОтбораПоСкладам()
	
	Если Объект.ТипФормированияДокументов = 1 Тогда
		
		Элементы.ГруппаПериод.Видимость 	= Истина;
		Элементы.Период.Видимость 			= Ложь;
		Элементы.Склад.Видимость            = Ложь;
	ИначеЕсли Объект.ТипФормированияДокументов = 2 Тогда
		
		Элементы.ГруппаПериод.Видимость 	= Ложь;
		Элементы.Период.Видимость 			= Истина;		
		Элементы.Склад.Видимость            = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделитьПоМаркировкеЧЗПриИзменении(Элемент)
	// Вставить содержимое обработчика.  
	Если Объект.РазделитьПоМаркировкеЧЗ Тогда
		//Объект.Период			=	НачалоДня(ТекущаяДата()+24*60*60);
		//Объект.ДатаФормирования	=	НачалоДня(ТекущаяДата()+24*60*60);
		//Объект.ДатаНачала		=	НачалоДня(ТекущаяДата()+24*60*60);
	КонецЕсли;
КонецПроцедуры
